from db.doc import PostAuto

autos = PostAuto.objects.filter()

result = []

for auto in autos:
    if not auto.location in result:
        result.append(auto.location)
    pass

print(result)

# g = (("Ивано-Франковск", "Ивано-Франковская", "Ивано-Франковск",),
#      ("Харьков", "Харьковская", "Харьков",),
#      ("Хмельницк", "Хмельницкая", "Хмельницк",),
#      ("Житомир", "Житомирская", "Житомир",),
#      ("Киев", "Киевская", "Киев",),
#      ("Днепропетровск", "Днепропетровская", "Днепропетровск",),
#      ("Донецк", "Донецкая", "Донецк",),
#      ("Запороже", "Запорожская", "Запороже",),
#      ("Полтава", "Полтавская", "Полтава",),
#      ("Одесса", "Одесская", "Одесса",),
#      ("Луганск", "Луганская", "Луганск",),
#      ("Николаев", "Николаевская", "Николаев",),
#      ("Черкассы", "Черкасская", "Черкассы",),
#      ("Львов", "Львовская", "Львов",),
#      ("Cумы", "Cумская", "Cумы",),
#      ("Кропивницкий", "Кропивницкая", "Кропивницкий",),
#      ("Закарпатская", "Закарпатье", "Закарпатская",),
#      ("Чернигов", "Черниговская", "Чернигов",),
#      ("Ровно", "Ровенская", "Ровно",),)
# r = (
#     ('Ивано-Франковск', 'Ивано-Франковская', 'Ивано-Франковск'),
#     ('Харьков', 'Харьковская', 'Харьков'),
#     ('Хмельницк', 'Хмельницкая', 'Хмельницк'),
#     ('Житомир', 'Житомирская', 'Житомир'),
#     ('Киев', 'Киевская', 'Киев'),
#     ('Харьков', 'Харьковская', 'Харьков'),
#     ('Харьков', 'Харьковская', 'Харьков'),
#     ('Харьков', 'Харьковская', 'Харьков'),
#     ('Харьков', 'Харьковская', 'Харьков'),
#     ('Харьков', 'Харьковская', 'Харьков'),
#     ('Харьков', 'Харьковская', 'Харьков'),
#     ('Харьков', 'Харьковская', 'Харьков'),
#     ('Харьков', 'Харьковская', 'Харьков'),
#     ('Харьков', 'Харьковская', 'Харьков'),
#     ('Харьков', 'Харьковская', 'Харьков'),
#     ('Харьков', 'Харьковская', 'Харьков'),
#     ('Харьков', 'Харьковская', 'Харьков'),
#     ('Харьков', 'Харьковская', 'Харьков'),
#     ('Харьков', 'Харьковская', 'Харьков'),
#     ('Харьков', 'Харьковская', 'Харьков'),
#     ('Харьков', 'Харьковская', 'Харьков'),
#     ('Харьков', 'Харьковская', 'Харьков'),
#     ('Харьков', 'Харьковская', 'Харьков'),
#     ('Харьков', 'Харьковская', 'Харьков'),
# )
# #
# # temp = 'fsef'
# #
# # print(next(filter(lambda item: item[0] == temp or item[1] == temp, r), ('', '', None))[2])
#
# varrz = [
#     ['Ивано-Франковск',
#      'Ивано-Франковская'],
#
#     ['Харьков',
#      'Харьковская'],
#
#     ['Хмельницк',
#      'Хмельницкая'],
#
#     ['Житомир',
#      'Житомирская'],
#
#     ['Киев',
#      'Киевская'],
#
#     ['Днепропетровск',
#      'Днепропетровская'],
#
#     ['Донецк',
#      'Донецкая'],
#
#     ['Запороже',
#      'Запорожская', ],
#
#     ['Полтава',
#      'Полтавская', ],
#
#     ['Одесса',
#      'Одесская', ],
#
#     ['Луганск',
#      'Луганская', ],
#
#     ['Николаев',
#      'Николаевская'],
#
#     ['Черкассы',
#      'Черкасская'],
#
#     ['Львов',
#      'Львовская'],
#
#     ['Cумы',
#      'Cумская'],
#
#     ['Кропивницкий',
#      'Кропивницкая'],
#
#     ['Закарпатская',
#      'Закарпатье'],
#
#     ['Чернигов',
#      'Черниговская'],
#
#     ['Ровно',
#      'Ровенская'],
# ]
#
# for i in varrz:
#     print(f'("{i[0]}", "{i[1]}", "{i[0]}",)', end=',')
